#question 1
#რა არის პითონი პროგრამირებაში?
#პითონი პროგრამირებაში არის ერთ ერთი ენა არსებობს



#question 2
#რა არის Turtle-ი Python-ში?
#Turtle Python-ში არის library
#ანუ ერთ-ერთი ბიბლიოთეკა


#question 3
#რას გამოიტანს ეს კოდი ტერმინალში?
print('heloo World')
#ამ კითხვაში პასუხი არის "heloo World"
#ამ კითხვამ ბევრი დააბნია სურათში ნაჩვენები
#იყო ლურჯი ხაზი რაზეც ზოგიერთს eror ეგონათ
#და ასევე იყო პასუხები ამის მსგავსი რომლებიც 
#სისწრაფეში შემოხაზეს ასეტი პასუხები იყო:
#"Hello world", ""helloo World""


#question 4
#რას გამოიტანს ეს კოდი ტერმინალში?
print(True>False)
#ამ კითხვამ მე დამაბნია რადგან აღარ მახსოვდა 
#პასუხი მაგრამ kahoot-ის შემდეგ ახსენეს რომ
#True ნიშნავდა 1-ს ხოლო False 0-ს ამიტომაც 
#პასუხი გამოვიდოდა True


#question 5
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 15
y = 4
print(x // y)
#აქ პასუხი იყო 3 რადგან "//" არის გაყოფა
#რომელიც გვიჩვენებს რამდენჯერ თავსდება
#ერთი რიცხვი მეორეში ანუ აჩვენებს რამდენი 
#მთელი გამოდის x არის 15 და y 4 ამიტომაც
#15 : 4 = 3,75 მაგრამ რადგან ჩვენ მარტო 
#მთელებს გვიჩვენებს 15-ში მოთავსდა 4
#3-ჯერ და თავისთავადა პასუხია 3


#quetion 6
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 10
y = "20"
print(x + y)
#ეს კოდი ტერმინალში გამოიტანს eror-ს
#რადგან როგორც ჩვენ ვიციტ და ნასწავლიც
#გვაქვს ინტეჯერი არ ემატება სტრინგს
#ინტეჯერი არის 10 რადგან მას გარშემო 
#არ აქვს ბრჭყალები ხოლო სტრინგია 
#20 რადგან მას აქვს პრჭყალები


#question 7
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 5
y = 2
print(x ** y)
#მე ეს კითხვა შემეშალა რადგან არ ვიცოდი
#რომ ორი ** ნიშნავდა ხარისხში აყვანას
#პასუხი კი არის 25 რადგან 5 რომ ავივანოთ
#2-ის ხარისხში იქნება 5*5 რაც უდრის 25-ს


#question 8
#if მუშაობს else-ის გარეშე
#პასუხები იყო True ან False
#ხოლო სწორი ვარიანტია True
#რადგან if ჩვეულებრივ მუშაობს 
#else-ის გარეშე else-ს ვიყენებთ
#როდესაც გვინდა დამატებით 
#ინფორმაცია ჩავწეროთ მაგ:
age = 18
if age ==18:
    print("good")
# else:
#     print("your still kid")
#else არის სხვა შემთხვევაში ანუ 
#როდესაც რაღაც რიცხვი სასურველი 
#არ არის და სხვა შემთხვევაში ჩავწერთ 
#ეს რიცხვი არ არის სასურველი


#question 9
#რითი მთავრდება for loop?
#ამ კითხვაზე პასუხი არის brake 
#მაგრამ მე არასწორად ჩავწერე 
#რადგან არ ვიცოდი brake თუ 
#ნიშნავდა ":" ამას მაგრამ ვიცოდი
#რომ for loop სრულდებოდა ":"
#ამ სიმბოლოთი 


#question 10
#რა იქნება თუ 10 % 3?
#პასუხი არის 1 რადგან რომ გაიყოფა
#რიცხვი რაც დარჩება ნაშთი ის არის %
#ხოლო აქ რომ 10 გაიყო 3-ზე ნაშთი 
#დარჩა ერთი


#question 11
#integer-ი მრავლდება string-ზე 
#აქ პასუხები იყო True და False ხოლო 
#სწორი იყო True რადგან integer-ი 
#მრავლდება string-ზე მაგ:
print("andria " * 5)


#question 12
#რას გამოიტანს ეს კოდი ტერმინალში?
print(3>4 or 3<5 and 500<400 or 320>244)
#აქ პასუხი არის True რადგან or-ში როდესაც 
#ერთი სწორია და ერთი არასწორი მაინც False-ია
#ორივე მხარეს არის or გამოყენებული და ორივე 
#მხარეს არის 1 შეცდომა მაინც მაგრამ შუაში
#გამოყენებულია and რაც იმას ნიშნავს რომ 
#მარცხნივაც და მარჯვნივაც ერთი სწორი რომ 
#არის მაინც True გამოდის


#question 13
#რა არის სია list?
#აქ პასუხი არის array, array ნიშნავს მასივს
#ხოლო სია არის მასივი რადგან ის მოიცავს 
#ყველაფერს სტრინგს,ინტეჯერს,ბულენს,
#ფლოათს და ა.შ.


#question 14
#რა არის ალგორითმი?
#ალგორითმი არის მოქმედების, ნაბიჯ-ნაბიჯ
#შესრულება :))
