#უნდა დავპრინტოთ age 
age = 10                
print(ati)  
#პირველ ხაზზე დავადეკლარირეთ ინტ ტიპის ცვლადი, ხოლო მეორე ხაზზე უნდა დაგვეპრინტა ჩვენი დადეკლარირებული ინტი. სანაცვლოდ კი დავპრინტეთ ინტის სახით სტრინგ ტიპის მნიშვნელობა, ანუ ათი
#ჩვენ უნდა გაგკვეკეთებინა შემდეგნაირად           
#age = 10
#print(age)

#უნდა დავპრინტოთ სრინგ ტიპის მნიშვნელობა
name = "saba"
print(saba)
#ჩვენ დავადეკლარირეთ სტრინგ ტიპის ცვლადი სახელად საბა, ხოლო მეორე ხაზში პრინტ ბრძანების საშუალებით გამოვიძახეთ ეს ცვლადი, ოღონდ შეცდომით რადგან ფრჩხილებში არ უნდა ჩაწერილიყო უშუალოდ საბა, და თუ ჩაიწერებოდა უნდა ყოფილიყო ბრჭყალებში, ანუ სტრინგ ტიპის. ეს არის ამ კოდის სწორი ჩაწერისხერხი
#name = "saba"
#print(name)