#შექმენით თქვენი ოჯახის წევრების სია, რომელშიც მოათავსებთ თქვენი ოჯახის წევრების სახელებს ელემენტებად, შემდეგ კი დაბეჭდეთ ერთ გრძელ წინადადებაში დიდი სტრინგი რომელშიც გამოიყენებთ სიის ელემენტებს და შეადგენთ წინადადებას, მე ვარ + სიიდან თქვენი სახელი, დედაჩემია + სიიდან დედიკოს სახელი, მამაჩემია + სიიდან მამიკოს სახელი და ასე შემდეგ
names =["Kakha," "Nato," "Elene," "Saba"]
me = "I am"
mom = "my mother is"
dad = "my dad is"
sister = "my sister is"
print("I am" + names[3])
print(mom + names[1])
print(dad + names[0])
print(sister + names[2])